# CC_RouteFromShape

## Description
Creates cable path from the given shape. The shape must be polygon, polyline or 3D polygon. Returns the handle of the created cable path.

```pascal
FUNCTION CC_RouteFromShape(hObj : HANDLE) : HANDLE;
```

```python

def vs.CC_RouteFromShape(hObj):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE||

## Version
Availability: from Vectorworks 2022
## Category
* ConnectCAD